1. Гистограмма
Ограничение времени	1 секунда
Ограничение памяти	64Mb
Ввод	стандартный ввод или input.txt
Вывод	стандартный вывод или output.txt
Вовочка ломает систему безопасности Пентагона. Для этого ему понадобилось узнать, какие символы в секретных зашифрованных посланиях употребляются чаще других. Для удобства изучения Вовочка хочет получить графическое представление встречаемости символов. Поэтому он хочет построить гистограмму количества символов в сообщении. Гистограмма — это график, в котором каждому символу, встречающемуся в сообщении хотя бы один раз, соответствует столбик, высота которого пропорциональна количеству этих символов в сообщении.

Формат ввода
Входной файл содержит зашифрованный текст сообщения. Он содержит строчные и прописные латинские буквы, цифры, знаки препинания («.», «!», «?», «:», «-», «,», «;», «(», «)»), пробелы и переводы строк. Размер входного файла не превышает 10000 байт. Текст содержит хотя бы один непробельный символ. Все строки входного файла не длиннее 200 символов.Для каждого символа c кроме пробелов и переводов строк выведите столбик из символов «#», количество которых должно быть равно количеству символов c в данном тексте. Под каждым столбиком напишите символ, соответствующий ему. Отформатируйте гистограмму так, чтобы нижние концы столбиков были на одной строке, первая строка и первый столбец были непустыми. Не отделяйте столбики друг от друга. Отсортируйте столбики в порядке увеличения кодов символов.

Формат вывода
Для каждого символа c кроме пробелов и переводов строк выведите столбик из символов «#», количество которых должно быть равно количеству символов c в данном тексте. Под каждым столбиком напишите символ, соответствующий ему. Отформатируйте гистограмму так, чтобы нижние концы столбиков были на одной строке, первая строка и первый столбец были непустыми. Не отделяйте столбики друг от друга. Отсортируйте столбики в порядке увеличения кодов символов.

```python
words = []
lib = dict()
with open('input.txt') as inf:
    for line in inf:
        line = line.strip()
        words += line
        #print(line)
words.sort()
words = list(filter(str.strip, words))
                
unique = list(set(words))

for i in unique:
    lib[i] = words.count(i)

sorted_tuple = dict(sorted(lib.items(), key=lambda x: (ord(x[0]))))
max_lib = max(lib.values())
#print(sorted_tuple)
l = len(unique)
A = [[0 for _ in range(max_lib+1)] for _ in range(l)]

for k, i, j in zip(sorted_tuple.items(), range(len(A)), sorted_tuple.values()):
    A[i] = [k[0]] + ['#' for i in range(j)] + [0 for i in range(max_lib-j)]
    
A_t = [[ A[row][col] for row in range(0, l) ] for col in range(max_lib, -1, -1) ]

for i in range(len(A_t)):
    if not all(x == 0 for x in A_t[i]):
        e = len(A_t[i])
        for j in range(e):
            if j == e-1:
                end = '\n'
            else:
                end=''
            if A_t[i][j] != 0:
                print(A_t[i][j], end=end)
            else:
                print(' ', end=end)
```
input :
```python
Twas brillig, and the slithy toves
Did gyre and gimble in the wabe;
All mimsy were the borogoves,
And the mome raths outgrabe.
```

output:
```python
         #              
         #              
         #              
         #              
         #              
         #         #    
         #  #      #    
      #  # ###  ####    
      ## ###### ####    
      ##############    
      ##############  ##
#  #  ############## ###
########################
,.;ADTabdeghilmnorstuvwy
```
